// ================================================================================================
// entrypoint: next-permutation
// 配列の次の順列を生成するジェネレーター関数を提供します。
// C++のSTLにある`next_permutation`関数にインスパイアされています。
// ================================================================================================

// ================================================================
// クラス本体
// ================================================================

/** Array#sort()でcompareFnを指定しなかったときのデフォルトの挙動と同じ挙動を示す比較関数。aが先なら負、bが先なら正、等しいなら0を返す。 */
const DEFAULT_COMPARE_FN = (a: unknown, b: unknown): number => {
    const [A, B] = [String(a), String(b)];
    return (A < B) ? -1 : (A > B) ? 1 : 0;
};

/**
 * 呼び出されるたびに配列の次の順列を返すジェネレーター関数。
 * - sort済みの配列を渡して`for...of`構文で回すことで順列全列挙が可能。
 * - `[...next_permutation(arr)]`のようにスプレッド構文で展開することで配列として取得可能。
 * @param arr 対象となる配列
 * @param compareFn 要素の比較関数。デフォルトでは文字列として辞書順に比較。
 * @yields 配列の各要素を並び替えたもの。呼び出されるたびに異なる並び順を辞書順に返し、辞書順で最も後ろの並び方を返したときにreturn(ジェネレーター終了)します。
 */
const next_permutation = function* <T>(
    arr: T[],
    compareFn: (a: T, b: T) => number = DEFAULT_COMPARE_FN,
): Generator<T[], void, unknown> {
    // 入力配列のコピーを作成する。
    const a = [...arr];

    while (true) {
        yield [...a]; // 現在の順列のコピーを返す（yield）。

        // 1. a[i] < a[i+1] を満たす最大のインデックス i を求める
        let i = a.length - 2;
        while (i >= 0 && compareFn(a[i], a[i + 1]) >= 0) {
            i--;
        }

        // そのようなインデックスが存在しない場合、現在の順列は最後の順列なので終了する。
        if (i < 0) {
            return;
        }

        // 2. a[i] < a[j] を満たす、i より大きい最大のインデックス j を求める
        let j = a.length - 1;
        while (compareFn(a[i], a[j]) >= 0) {
            j--;
        }

        // 3. a[i] と a[j] を交換する
        [a[i], a[j]] = [a[j], a[i]];

        // 4. a[i+1] から末尾までの部分列を反転する
        let l = i + 1;
        let r = a.length - 1;
        while (l < r) {
            [a[l], a[r]] = [a[r], a[l]];
            l++;
            r--;
        }
    }
};

// ================================================================
// エクスポート
// ================================================================

export { next_permutation };
